app/Controllers/AdminController.php

    public function rekapPresensi()
    {
        $presensiModel = new \App\Models\PresensiModel();
        $builder = $presensiModel->select('presensi.*, user.nama, user.nim, user.kampus')
                                ->join('user', 'user.id = presensi.user_id')
                                ->orderBy('tanggal', 'DESC');
        $data['rekap'] = $builder->findAll();
---
SELECT `presensi`.*, `user`.`nama`, `user`.`nim`, `user`.`kampus`
FROM `presensi`
JOIN `user` ON `user`.`id` = `presensi`.`user_id`
ORDER BY `tanggal` DESC

    public function kelolaPeserta()
    {
        $userModel = new \App\Models\UserModel();
        $peserta = $userModel->findAll(); // jika role tidak disimpan, hapus where()
---
SELECT *
FROM `user`