app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows` FROM `user`
SELECT COUNT(*) AS `numrows`
FROM `presensi`
WHERE `tanggal` = '2025-06-19'
AND `status` = 'hadir'
SELECT COUNT(*) AS `numrows`
FROM `presensi`
WHERE `status` = 'hadir'
SELECT COUNT(*) AS `numrows` FROM `presensi`
SELECT COUNT(*) AS `numrows`
FROM `presensi`
WHERE `status` = 'alpha'
SELECT COUNT(*) AS `numrows`
FROM `presensi`
WHERE `tanggal` = '2025-06-13'
AND `status` = 'hadir'
---
    public function dashboarda()
    {
        $userModel = new UserModel();
        $presensiModel = new PresensiModel();

        $totalPeserta = $userModel->countAll();
        $hadirHariIni = $presensiModel->where('tanggal', date('Y-m-d'))->where('status', 'hadir')->countAllResults();
        $totalHadir = $presensiModel->where('status', 'hadir')->countAllResults();
        $totalPresensi = $presensiModel->countAll();
        $tingkatKehadiran = $totalPresensi > 0 ? round(($totalHadir / $totalPresensi) * 100) : 0;
        $perluPerhatian = $presensiModel->where('status', 'alpha')->countAllResults();

        // Data grafik kehadiran 7 hari terakhir
        $labelTanggal = [];
        $jumlahHadir = [];
        for ($i = 6; $i >= 0; $i--) {
            $tgl = date('Y-m-d', strtotime("-$i days"));
            $labelTanggal[] = date('d M', strtotime($tgl));
            $jumlahHadir[] = $presensiModel->where('tanggal', $tgl)->where('status', 'hadir')->countAllResults();

SELECT `presensi`.*, `user`.`nama`, `user`.`nim`, `user`.`kampus`
FROM `presensi`
JOIN `user` ON `user`.`id` = `presensi`.`user_id`
ORDER BY `tanggal` DESC
---
    public function rekapPresensi()
    {
        $presensiModel = new \App\Models\PresensiModel();
        $builder = $presensiModel->select('presensi.*, user.nama, user.nim, user.kampus')
                                ->join('user', 'user.id = presensi.user_id')
                                ->orderBy('tanggal', 'DESC');
        $data['rekap'] = $builder->findAll();

SELECT *
FROM `user`
---
    public function kelolaPeserta()
    {
        $userModel = new \App\Models\UserModel();
        $peserta = $userModel->findAll(); // jika role tidak disimpan, hapus where()