app/Controllers/UserController.php

SELECT *
FROM `user`
WHERE `user`.`id` = '18'
---
    public function dashboardu()
    {
        $userModel = new UserModel();
        $user = $userModel->find(session()->get('id'));

SELECT *
FROM `user`
WHERE `user`.`id` = '1'
---
    public function profile()
    {
        $userModel = new UserModel();
        $user = $userModel->find(session()->get('id'));

UPDATE `user` SET `password` = '$2y$10$qJdifSThAI8l52aEAKCTjOAram7XOpxK8fu2UFRXbFIcRD.IdT97G'
WHERE `user`.`id` IN ('1')
---
                return redirect()->back()->with('error', 'Tidak ada data yang diperbarui.');
            }

            $userModel->update($id, $data);

SELECT *
FROM `presensi`
WHERE `user_id` = '18'
AND `tanggal` = '2025-06-17'
 LIMIT 1
---
    public function presensi()
    {
        $userId = session()->get('id');
        $user = $this->userModel->find($userId);

        $today = date('Y-m-d');
        $presensiHariIni = $this->presensiModel
            ->where('user_id', $userId)
            ->where('tanggal', $today)
            ->first();

SELECT *
FROM `user`
WHERE `user`.`id` = '1'
SELECT *
FROM `presensi`
WHERE `user_id` = '1'
ORDER BY `tanggal` DESC
SELECT COUNT(*) AS `numrows`
FROM `presensi`
WHERE `user_id` = '1'
AND `status` = 'Alpha'
---
    public function riwayat()
    {
        $userId = session()->get('id');
        $user = $this->userModel->find($userId);

        $riwayatPresensi = $this->presensiModel
            ->where('user_id', $userId)
            ->orderBy('tanggal', 'DESC')
            ->findAll();

        $totalHadir = $this->presensiModel->where('user_id', $userId)->where('status', 'Hadir')->countAllResults();

SELECT *
FROM `user`
WHERE `user`.`id` = '1'
SELECT *
FROM `izin`
WHERE `user_id` = '1'
ORDER BY `tanggal` DESC
---
public function izin()
    {
        $userId = session()->get('id');
        $user = $this->userModel->find($userId);

        $daftarIzin = $this->izinModel->where('user_id', $userId)->orderBy('tanggal', 'DESC')->findAll();