app/Controllers/UserController.php

SELECT *
FROM `user`
WHERE `user`.`id` = '1'
---
    public function updatePassword()
    {
        $userModel = new UserModel();
        $request = \Config\Services::request();
        $session = session();
        $id = $session->get('id');

        $oldPassword = $request->getPost('old_password');
        $newPassword = $request->getPost('new_password');
        $confirmPassword = $request->getPost('confirm_password');

        // Ambil data user berdasarkan ID
        $user = $userModel->find($id);